app/controllers/apart_types_controller.rb

  def index
    @apart_types = ApartType.all
---
SELECT "apart_types".* FROM "apart_types"

  def create
    @apart_type = ApartType.new(apart_type_params)

    respond_to do |format|
      if @apart_type.save
---
INSERT INTO "apart_types" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2019-04-06 07:16:34.294146"], ["updated_at", "2019-04-06 07:16:34.294146"]]

    def set_apart_type
      @apart_type = ApartType.find(params[:id])
---
SELECT  "apart_types".* FROM "apart_types" WHERE "apart_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]