app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "surname", "dni", "mail", "phone", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["surname", ""], ["dni", ""], ["mail", ""], ["phone", ""], ["message", ""], ["created_at", "2019-04-05 17:40:29.533126"], ["updated_at", "2019-04-05 17:40:29.533126"]]
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save

UPDATE "customers" SET "surname" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["surname", "fefe"], ["updated_at", "2019-04-05 17:40:59.813305"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @customer.update(customer_params)