app/controllers/meetings_controller.rb

  def create
    @meeting = Meeting.new(meeting_params)

    respond_to do |format|
      if @meeting.save
---
INSERT INTO "meetings" ("name", "surname", "mail", "phone", "date", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)