app/controllers/proyects_controller.rb

SELECT "proyects".* FROM "proyects"
---
  def index
    @proyects = Proyect.all

INSERT INTO "proyects" ("name", "district", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["district", ""], ["address", ""], ["created_at", "2019-04-05 15:14:40.468128"], ["updated_at", "2019-04-05 15:14:40.468128"]]
---
  def create
    @proyect = Proyect.new(proyect_params)

    respond_to do |format|
      if @proyect.save

SELECT  "proyects".* FROM "proyects" WHERE "proyects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_proyect
      @proyect = Proyect.find(params[:id])