app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("dni", "name", "surname", "profile", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["dni", ""], ["name", ""], ["surname", ""], ["profile", ""], ["created_at", "2019-04-05 06:37:25.750466"], ["updated_at", "2019-04-05 06:37:25.750466"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "profile" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile", "Asesor"], ["updated_at", "2019-04-05 07:11:31.080339"], ["id", 12]]